#ifndef stddecimal_libdecimal_decimal_hpp
#define stddecimal_libdecimal_decimal_hpp

#include <ios>
#include <exception>
#include <string>
#include <IntelRDFPMathLib20U2/LIBRARY/src/bid_conf.h>
#include <IntelRDFPMathLib20U2/LIBRARY/src/bid_functions.h>

namespace std::decimal
{

// 3.5 Additions to <cfenv> and <fenv.h>

constexpr int FE_DEC_TONEAREST = BID_ROUNDING_TO_NEAREST;
constexpr int FE_DEC_DOWNWARD = BID_ROUNDING_DOWN;
constexpr int FE_DEC_UPWARD = BID_ROUNDING_UP;
constexpr int FE_DEC_TOWARD_ZERO = BID_ROUNDING_TO_ZERO;
constexpr int FE_DEC_TONEARESTFROMZERO = BID_ROUNDING_TIES_AWAY;

// There is no mention of changes to exception state in the standard so I am assuming that the floating point and decimal operations 
// would share a single exception state. This implementation doesn't really want to affect the compiler runtime state so we need to 
// supply our own. We need to redefine the exception constants because their values are implementation defined, add _DEC_ to the names 
// as well as placing them in the std::decimal namespace to avoid any clashes or confusion.
using fexcept_t = int;

constexpr fexcept_t FE_DEC_DIVBYZERO = BID_ZERO_DIVIDE_EXCEPTION;
constexpr fexcept_t FE_DEC_INEXACT = BID_INEXACT_EXCEPTION;
constexpr fexcept_t FE_DEC_INVALID = BID_INVALID_EXCEPTION;
constexpr fexcept_t FE_DEC_OVERFLOW = BID_OVERFLOW_EXCEPTION;
constexpr fexcept_t FE_DEC_UNDERFLOW = BID_UNDERFLOW_EXCEPTION;
constexpr fexcept_t FE_DEC_ALL_EXCEPT = FE_DEC_DIVBYZERO | 
                                        FE_DEC_INEXACT | 
                                        FE_DEC_INVALID | 
                                        FE_DEC_OVERFLOW | 
                                        FE_DEC_UNDERFLOW;

// NB: Environment state is per thread.
struct fenv_t
{
    int round;
    unsigned int flags;
    bool hold;
    unsigned int exceptions;
};

// Rename the global floating point environment functions by adding _dec_ to the names so there is no ambiguity and they
// match the decimal specific fe_dec_getround and fe_dec_setround.

// Clears the specified floating-point status flags
// 0​ if all indicated exceptions were successfully cleared or if excepts is zero. Returns a non-zero value on error.
int fe_dec_clearexcept(int except);

// Raises the specified floating-point exceptions 
// ​0​ if all listed exceptions were raised, non-zero value otherwise.
int fe_dec_raiseexcept(int except);

// Copies the state of the specified floating-point status flags from or to the floating-point environment
// ​0​ on success, non-zero otherwise.
int fe_dec_setexceptflag(const fexcept_t *pflag, int except);
int fe_dec_getexceptflag(fexcept_t *pflag, int except);

// Determines which of the specified floating-point status flags are set
// Returns: Bitwise OR of the floating-point exception macros that are both included in excepts and correspond to floating-point exceptions currently set.
int fe_dec_testexcept(int except);

// Attempts to store the status of the floating-point environment in the object pointed to by envp.
// ​0​ on success, non-zero otherwise.
int fe_dec_getenv(fenv_t *penv);

// Attempts to establish the floating-point environment from the object pointed to by envp. 
// ​0​ on success, non-zero otherwise.
int fe_dec_setenv(const fenv_t *penv);

// Saves the environment, clears all status flags and ignores all future errors
// ​0​ on success, non-zero otherwise.
int fe_dec_holdexcept(fenv_t *penv);

// restores the floating-point environment and raises the previously raise exceptions 
// 0​ on success, non-zero otherwise.
int fe_dec_updateenv(const fenv_t *penv);

// These are additions for decimal. Unlike the exception flags they don't overlap with the regular floating point counterparts.

// Gets the current rounding direction for decimal floating-point operations.
int fe_dec_getround();

// Establishes round as the rounding direction for decimal floating-point operations. If round is not equal to the value of a DFP 
// rounding direction macro, the rounding direction is not changed.
// Returns: a zero value if and only if the argument is equal to one of the rounding direction macros
int fe_dec_setround(int round);


// Extensions

class exception : public std::exception
{
public:

    exception(fexcept_t flags);
    constexpr fexcept_t flags() const { return m_flags; }
    const char* what() const noexcept override { return m_what.c_str(); }

private:

    fexcept_t m_flags;
    std::string m_what;

};

// Throw a C++ exception whenever an exception in the except mask is raised. This will prevent the specified
// exceptions from being set in the environment flags, other exceptions will be unnaffected.
// This also clears these exceptions from the environment flags if they are set.
// Any operation involving the decimal types may require multiple calls to the underlying Intel library, the
// exception state will only be checked at the end of the sequence of operations so the exception flags may
// have multiple exception flags set. This allows all the exceptions to be communicated to the caller but 
// there is no ordering information available which is atleast consistent with the fe_dec* api.
void set_exceptions(int except) noexcept;
// Disable C++ exceptions for the exceptions in the except mask.
void clear_exceptions(int except) noexcept;
// Return the current exception mask.
int get_exceptions() noexcept;
// If any exceptions have been raised in the environment flags then throw a C++ std::decimal::exception.
// This is primarily for internal use but can be called explicitly if it is not desirable to use set_exceptions in
// some circumstances. 
void check_exceptions();


class decimal32;
class decimal64;
class decimal128;

// - if one or both of the parameters of the overloaded operator is decimal128, then the return type is decimal128,
// - otherwise, if one or both of the parameters is decimal64, then the return type is decimal64,
// - otherwise, the return type is decimal32.

template<typename T> struct value_traits;
template<> struct value_traits<decimal32> { static constexpr int width() { return sizeof(BID_UINT32) * 8; }  };
template<> struct value_traits<decimal64> { static constexpr int width() { return sizeof(BID_UINT64) * 8; }  };
template<> struct value_traits<decimal128> { static constexpr int width() { return sizeof(BID_UINT128) * 8; }  };
template<> struct value_traits<BID_UINT128> { static constexpr int width() { return sizeof(BID_UINT128) * 8; }  };
template<> struct value_traits<int> { static constexpr int width() { static_assert(sizeof(int) == 4); return sizeof(int) * 8; }  };
template<> struct value_traits<unsigned int> { static constexpr int width() { static_assert(sizeof(int) == 4); return sizeof(unsigned int) * 8; }  };
template<> struct value_traits<long> { static constexpr int width() { static_assert(sizeof(long) == 8); return sizeof(long) * 8; }  };
template<> struct value_traits<unsigned long> { static constexpr int width() { static_assert(sizeof(unsigned long) == 8); return sizeof(unsigned long) * 8; }  };
template<> struct value_traits<long long> { static constexpr int width() { static_assert(sizeof(long long) == 8); return sizeof(long long) * 8; }  };
template<> struct value_traits<unsigned long long> { static constexpr int width() { static_assert(sizeof(unsigned long long) == 8); return sizeof(unsigned long long) * 8; }  };
template<> struct value_traits<float> { static constexpr int width() { static_assert(sizeof(float) == 4); return sizeof(float) * 8; }  };
template<> struct value_traits<double> { static constexpr int width() { static_assert(sizeof(double) == 8); return sizeof(double) * 8; }  };
template<> struct value_traits<long double> { static constexpr int width() { static_assert(sizeof(long double) == 16); return sizeof(long double) * 8; }  };

struct operator_32bit {

    using binary_result_type = decimal32;

    static void add(BID_UINT32& lhs, BID_UINT32 rhs);
    static void sub(BID_UINT32& lhs, BID_UINT32 rhs);
    static void mul(BID_UINT32& lhs, BID_UINT32 rhs);
    static void div(BID_UINT32& lhs, BID_UINT32 rhs);
    static bool equal(BID_UINT32 lhs, BID_UINT32 rhs);
    static bool not_equal(BID_UINT32 lhs, BID_UINT32 rhs);
    static bool less(BID_UINT32 lhs, BID_UINT32 rhs);
    static bool less_equal(BID_UINT32 lhs, BID_UINT32 rhs);
    static bool greater(BID_UINT32 lhs, BID_UINT32 rhs);
    static bool greater_equal(BID_UINT32 lhs, BID_UINT32 rhs);
    static BID_UINT32 resize(decimal32 value);
    static BID_UINT32 resize(decimal64 value);
    static BID_UINT32 resize(decimal128 value);
    static BID_UINT32 resize(int value);
    static BID_UINT32 resize(unsigned int value);
    static BID_UINT32 resize(long value);
